app/views/contracts/show.html.erb

			<%= link_to '料件', contract_materials_path(:contract_id => @contract.id) %> |
			<% if @contract.contract_products.size > 0 %> <%= link_to '单耗', contract_consumptions_path(:contract_product_id => @contract.contract_products.first.id) %> |<% end %>
---
SELECT COUNT(*) FROM `contract_products` WHERE `contract_products`.`contract_id` = 1