app/views/users/enterprises.html.erb

					<% @enterprises.each do |enterprise| %>
					<% manage_relationship = @user.manage_relationships.find_by_enterprise_id(enterprise.id) %>
---
SELECT `manage_relationships`.* FROM `manage_relationships` WHERE `manage_relationships`.`user_id` = 1 AND `manage_relationships`.`enterprise_id` = 1 ORDER BY manage_relationships.id DESC LIMIT 1