app/views/shared/_enterprise_selector.html.erb

	  <option value="0">请选择企业</option>
	  <% current_user.enterprises.each do |enterprise| %>
---
SELECT `enterprises`.* FROM `enterprises` INNER JOIN `manage_relationships` ON `enterprises`.`id` = `manage_relationships`.`enterprise_id` WHERE `manage_relationships`.`user_id` = 1 ORDER BY manage_relationships.id DESC