app/views/declarations/print_declaration.html.erb

SELECT `dict_customs`.* FROM `dict_customs` WHERE `dict_customs`.`code` = '5220' ORDER BY code LIMIT 1
SELECT `dict_load_ports`.* FROM `dict_load_ports` WHERE `dict_load_ports`.`code` = '5269' ORDER BY code LIMIT 1
SELECT `dict_ports`.* FROM `dict_ports` WHERE `dict_ports`.`code` = '142' ORDER BY code LIMIT 1
---
        <span class="not_print">预录入编号：</span><span class="content"><%= @declaration.pre_entry_no %></span>
        <span class="content">申报现场:<%= dict_name_and_code Dict::Custom, Dict::LoadPort.find_by_code(@declaration.load_port).custom_code rescue '' %></span>