app/views/declarations/show.html.erb

SELECT COUNT(*) FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1
---
<div id="print_dialog" style="display: none">
	<% if @declaration.declaration_cargos.size > 0 %>

SELECT COUNT(*) FROM `dispatch_records` WHERE `dispatch_records`.`declaration_id` = 1
---

<% if @declaration.dispatch_records.size > 0 %>