app/views/declaration_containers/new.html.erb

				<tbody>
					<% Dict::MetalCabinet.all.each do |metal_cabinet| %>
---
SELECT `dict_metal_cabinets`.* FROM `dict_metal_cabinets` ORDER BY code

				<tbody>
					<% Dict::Bracket.all.each do |bracket| %>
---
SELECT `dict_brackets`.* FROM `dict_brackets` ORDER BY code