app/controllers/cargos_controller.rb

SELECT COUNT(*) FROM `cargos` WHERE `cargos`.`enterprise_id` IS NULL
SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`enterprise_id` = 1 ORDER BY updated_at DESC LIMIT 10 OFFSET 0
SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`enterprise_id` IS NULL LIMIT 10 OFFSET 0
---
  def index
    if current_enterprise
      @cargos = current_enterprise.cargos.page(params[:page]).order("updated_at DESC")
    else
      @cargos = Enterprise.new.cargos.paginate(:page => params[:page],:per_page => 10)

SELECT `cargos`.* FROM `cargos` WHERE (code like '1%' or name like '%1%')
---
  def search
    term = params[:term]
    if term.blank?
    @cargos = []
    else
      @cargos = Cargo.where("code like ? or name like ?", term + '%', '%' + term +'%')

SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`id` = 1 LIMIT 1
---
  def show
    @cargo = Cargo.find(params[:id])

SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`id` = 1 LIMIT 1
---
  def edit
    @cargo = Cargo.find(params[:id])

SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`id` = 1 LIMIT 1
UPDATE `cargos` SET `code` = '8473309000', `unit` = '007', `unit1` = '035', `unit2` = '', `trade_country` = '142 ', `updated_at` = '2013-04-03 16:07:52' WHERE `cargos`.`id` = 1
---
  def update
    @cargo = Cargo.find(params[:id])

    respond_to do |format|
      if @cargo.update_attributes(params[:cargo])

SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`enterprise_id` = 1 ORDER BY updated_at DESC
---
  def print_cargos
    #todo 1.authorize 2.@cargos from parameter
    #authorize! :show, @cargos
    if current_enterprise
      @cargos = current_enterprise.cargos.order("updated_at DESC")