app/controllers/contracts_controller.rb

  def index
    if current_enterprise
      @contracts = current_enterprise.contracts.paginate(:page => params[:page],:per_page => 10, :order => "contracts.updated_at DESC")
---
SELECT COUNT(*) FROM `contracts` WHERE `contracts`.`enterprise_id` IS NULL
SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`enterprise_id` = 1 ORDER BY updated_at DESC LIMIT 10 OFFSET 0

  def show
    @contract = Contract.find(params[:id])
---
SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 1 LIMIT 1