app/controllers/contract_materials_controller.rb

  def search
    @term = params[:term]
    if @term.blank?
      @contract_materials = []
    else
      term = '%' + @term + '%'
      contract_id = @contract ? @contract.id : 0
      @contract_materials = ContractMaterial.where("contract_id = ? and (no like ? or code like ? or name like ?)", contract_id, term, term, term)
---
SELECT `contract_materials`.* FROM `contract_materials` WHERE (contract_id = 1 and (no like '%1%' or name like '%1%'))