app/controllers/declaration_containers_controller.rb

SELECT COUNT(*) FROM `declaration_containers` WHERE `declaration_containers`.`declaration_id` = 1
SELECT `declaration_containers`.* FROM `declaration_containers` WHERE `declaration_containers`.`declaration_id` = 1 LIMIT 10 OFFSET 0
---
  def index
    @declaration_containers = @declaration.declaration_containers.page(params[:page])

INSERT INTO `declaration_containers` (`bracket`, `code`, `container`, `created_at`, `declaration_id`, `metal_cabinet`, `updated_at`) VALUES ('A1', '1', 'L', '2013-04-06 05:54:03', 1, '1', '2013-04-06 05:54:03')
---
  def create
    @declaration_container = DeclarationContainer.new(params[:declaration_container])

    respond_to do |format|
      if @declaration_container.save