app/controllers/declaration_packings_controller.rb

  def index
    @declaration_packings = @declaration.declaration_packings.page(params[:page])
---
SELECT COUNT(*) FROM `declaration_packings` WHERE `declaration_packings`.`declaration_id` = 1
SELECT `declaration_packings`.* FROM `declaration_packings` WHERE `declaration_packings`.`declaration_id` = 1 LIMIT 10 OFFSET 0

  def new
    @declaration_packing = DeclarationPacking.new(:declaration_id => @declaration.id,
                                                  :no => @declaration.declaration_packings.size + 1)
---
SELECT COUNT(*) FROM `declaration_packings` WHERE `declaration_packings`.`declaration_id` = 1

  def create
    @declaration_packing = DeclarationPacking.new(params[:declaration_packing])

    respond_to do |format|
      if @declaration_packing.save
---
INSERT INTO `declaration_packings` (`created_at`, `declaration_id`, `gross_weight`, `gross_weight_per_package`, `name`, `net_weight`, `net_weight_per_package`, `no`, `package_amount`, `quantity`, `unit`, `updated_at`) VALUES ('2013-04-06 05:47:35', 1, 1, 1, '连接器/插座', 1, 1, 1, 1, 1, '035', '2013-04-06 05:47:35')

  def destroy
    @declaration_packing.destroy
---
DELETE FROM `declaration_packings` WHERE `declaration_packings`.`id` = 1