app/controllers/declaration_cargos_controller.rb

SELECT COUNT(*) FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1
SELECT `declaration_cargos`.* FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1 LIMIT 10 OFFSET 0
---
  def index
    @declaration_cargos = @declaration.declaration_cargos.page(params[:page])

SELECT COUNT(*) FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1
---
  def new
    @declaration_cargo = DeclarationCargo.new(:declaration_id => @declaration.id,
                                              :quantity1 => 0,
                                              :quantity2 => 0,
                                              :tax_mode => 3,
                                              :no => @declaration.declaration_cargos.size + 1)

INSERT INTO `declaration_cargos` (`code`, `created_at`, `currency`, `declaration_id`, `goods_version`, `name`, `no`, `no_in_contract`, `quantity`, `quantity1`, `quantity2`, `specification`, `tax_mode`, `trade_country`, `unit`, `unit1`, `unit2`, `unit_price`, `updated_at`) VALUES ('8536900000', '2013-04-03 15:15:31', '502', 1, '', '连接器/插座', 1, 8, 343.3, 343.3, 0.0, '电压<1000伏|12V|无牌|Z100055|汽车用', '3', '142', '035', '035', '', 44.382, '2013-04-03 15:15:31')
---
  def create
    @declaration_cargo = DeclarationCargo.new(params[:declaration_cargo])

    respond_to do |format|
      if @declaration_cargo.save