app/controllers/declarations_controller.rb

SELECT COUNT(*) FROM `declarations` WHERE (enterprise_id = 1 and declaration_type = 'import')
SELECT `declarations`.* FROM `declarations` WHERE (enterprise_id = 1 and declaration_type = 'import') ORDER BY updated_at DESC LIMIT 10 OFFSET 0
SELECT `enterprises`.* FROM `enterprises` WHERE `enterprises`.`id` = 1 LIMIT 1
---
  def index
    if current_enterprise
      @declarations = Declaration.where("enterprise_id = ? and declaration_type = ?", current_enterprise.id, @declaration_type).page(params[:page]).order("updated_at DESC")
    else
      @declarations = Enterprise.new.declarations.page(params[:page])

SELECT `declaration_cargos`.* FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1 ORDER BY no
SELECT COUNT(*) FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1
---
  def print_declaration
    authorize! :show, @declaration
    @declaration_cargos = @declaration.declaration_cargos.order("no")
    @groups = Array.new((@declaration_cargos.size - 1) / 5 + 1) { Array.new }

SELECT `declaration_cargos`.* FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1 ORDER BY no
---
  def print_contract
    authorize! :show, @declaration
    @declaration_cargos = @declaration.declaration_cargos.order("no")

SELECT `declaration_cargos`.* FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1 ORDER BY no
---
  def print_contract2
    authorize! :show, @declaration
    @declaration_cargos = @declaration.declaration_cargos.order("no")

SELECT `declaration_cargos`.* FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1 ORDER BY no
---
  def print_invoice
    authorize! :show, @declaration
    @declaration_cargos = @declaration.declaration_cargos.order("no")

SELECT `declaration_packings`.* FROM `declaration_packings` WHERE `declaration_packings`.`declaration_id` = 1 ORDER BY no
---
  def print_packing1
    authorize! :show, @declaration
    @declaration_packings = @declaration.declaration_packings.order("no")

SELECT `declaration_packings`.* FROM `declaration_packings` WHERE `declaration_packings`.`declaration_id` = 1 ORDER BY no
---
  def print_packing2
    authorize! :show, @declaration
    @declaration_packings = @declaration.declaration_packings.order("no")

SELECT `declaration_cargos`.* FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1 ORDER BY no
---
  def print_packing3
    authorize! :show, @declaration
    @declaration_cargos = @declaration.declaration_cargos.order("no")

UPDATE `declarations` SET `transit_type` = '001', `custom` = '5220', `operate_enterprise_code` = '61235698', `voyage_no` = '', `trade_mode` = '0214', `tax_kind` = '502', `trade_country` = '142', `port` = '142', `destination` = '44199', `bill_no` = '', `contract_no` = '2012/0001', `package_amount` = 40, `gross_weight` = 626.0, `net_weight` = 343.3, `attachments_mark` = '', `usage` = '05', `load_port` = '5269', `memo` = '一日游/40胶箱/车牌：湘E4B112', `foreign_enterprise_code` = '', `declare_enterprise_code` = '61235698', `declarant` = '', `warehouse_no` = '', `updated_at` = '2013-04-03 15:07:32' WHERE `declarations`.`id` = 1
---
  def update
    authorize! :update, @declaration
    respond_to do |format|
      if @declaration.update_attributes(params[:declaration])

DELETE FROM `declarations` WHERE `declarations`.`id` = 1
---
  def destroy
    authorize! :destory, @declaration
    @declaration.destroy

SELECT `declaration_cargos`.* FROM `declaration_cargos` WHERE `declaration_cargos`.`declaration_id` = 1 ORDER BY no
---
  def print_attorney
    authorize! :show, @declaration
    @declaration_cargos = @declaration.declaration_cargos.order("no")