app/controllers/enterprises_controller.rb

  def index
    @enterprises = Enterprise.page(params[:page]).order("updated_at DESC")
---
SELECT COUNT(*) FROM `enterprises`
SELECT `enterprises`.* FROM `enterprises` ORDER BY updated_at DESC LIMIT 10 OFFSET 0

  def search
    @term = params[:term]
    if @term.blank?
      @enterprises = []
    else
      @enterprises = Enterprise.where("code like ? or name like ?", '%' + @term + '%', '%' + @term +'%')
---
SELECT `enterprises`.* FROM `enterprises` WHERE (code like '%61235698%' or name like '%61235698%')

  def show
    @enterprise = Enterprise.find(params[:id])
---
SELECT `enterprises`.* FROM `enterprises` WHERE `enterprises`.`id` = 59 LIMIT 1

  def show_by_code
    @enterprise = Enterprise.find_by_code(params[:id])
---
SELECT `enterprises`.* FROM `enterprises` WHERE `enterprises`.`code` = '61235698' LIMIT 1