app/controllers/foreign_enterprises_controller.rb

SELECT `foreign_enterprises`.* FROM `foreign_enterprises` WHERE `foreign_enterprises`.`id` = 0 LIMIT 1
---
  def show
    @foreign_enterprise = ForeignEnterprise.find(params[:id])

SELECT `foreign_enterprises`.* FROM `foreign_enterprises` WHERE `foreign_enterprises`.`code` = '1' LIMIT 1
---
  def show_by_code
    @foreign_enterprise = ForeignEnterprise.find_by_code(params[:id])