app/controllers/manage_relationships_controller.rb

  def create
    @manage_relationship = ManageRelationship.new(params[:manage_relationship])
    @user = User.find(@manage_relationship.user_id)
    if @manage_relationship.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `manage_relationships` (`created_at`, `enterprise_id`, `updated_at`, `user_id`) VALUES ('2013-04-03 14:12:52', 1, '2013-04-03 14:12:52', 1)