app/controllers/pages_controller.rb

  def select_enterprise
    enterprise = Enterprise.find_by_id(params[:current_enterprise_id])
---
SELECT `enterprises`.* FROM `enterprises` WHERE `enterprises`.`id` = 1 LIMIT 1