app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY updated_at DESC LIMIT 10 OFFSET 0
---
  def index
    @title = "用户列表"
    @users = User.page(params[:page]).order("updated_at DESC")

SELECT `users`.* FROM `users` WHERE `users`.`id` = 210 LIMIT 1
---
  def edit
    @title = "编辑用户资料"
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 210 LIMIT 1
UPDATE `users` SET `username` = 'zhsenl', `name` = 'sumlit cheng', `roles_mask` = 15, `encrypted_password` = '0d042d380ec166e980a3506209da4f6b93eb5b05bb09b5c12d16c6345eaae1ed', `updated_at` = '2013-04-06 07:23:29' WHERE `users`.`id` = 220
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `enterprises` INNER JOIN `manage_relationships` ON `enterprises`.`id` = `manage_relationships`.`enterprise_id` WHERE `manage_relationships`.`user_id` = 1
SELECT `enterprises`.* FROM `enterprises` INNER JOIN `manage_relationships` ON `enterprises`.`id` = `manage_relationships`.`enterprise_id` WHERE `manage_relationships`.`user_id` = 1 ORDER BY manage_relationships.id DESC LIMIT 10 OFFSET 0
---
  def enterprises
    @user = User.find(params[:id])
    @title = @user.username + " 的授权企业列表"
    @enterprises = @user.enterprises.paginate(:page => params[:page],:per_page => 10)