app/controllers/dict/countries_controller.rb

SELECT COUNT(*) FROM `dict_countries`
---
  def index
    @dict_countries = Dict::Country.all

SELECT `dict_countries`.* FROM `dict_countries` WHERE `dict_countries`.`id` = 0 ORDER BY code LIMIT 1
---
  def show
    @dict_country = Dict::Country.find(params[:id])