app/controllers/dict/units_controller.rb

  def index
    @dict_units = Dict::Unit.paginate(:page => params[:page],:per_page => 10)
---
SELECT COUNT(*) FROM `dict_units`
SELECT `dict_units`.* FROM `dict_units` ORDER BY code LIMIT 10 OFFSET 0

  def show
    @dict_unit = Dict::Unit.find(params[:id])
---
SELECT `dict_units`.* FROM `dict_units` WHERE `dict_units`.`id` = 0 ORDER BY code LIMIT 1